import Image from "next/image";
import React, { useEffect } from "react";
import image2 from "@/public/images/care1 (3).webp";
import image3 from "@/public/images/care1 (1).webp";
import image4 from "@/public/images/care1 (1).webp";
import image5 from "@/public/images/care1 (3).webp";
import image6 from "@/public/images/care1 (4).webp";
import image7 from "@/public/images/care1 (5).jpg";

const CareArticle = () => {
  return (
    <div>
      <Image
        src={image2}
        alt=""
        width={1200}
        height={1200}
        className="w-[100%] aspect-[1/0.5] object-cover"
      />
      <div className="flex flex-col px-4">
        <div className="flex flex-col">
          <h1 className="mx-auto text-center max-w-[70%] mb-12 mt-5 text-2xl">
            غسل الملابس بالطريقة الصحيحة يساعد في الحفاظ على ألوانها وجودة
            نسيجها. أولاً، افصل الملابس حسب الألوان، حيث تُغسل الملابس البيضاء
            منفصلة عن الملونة لتجنب التصبغات. استخدم درجة حرارة الماء المناسبة
            لنوع القماش؛ الملابس القطنية تتحمل الماء الساخن، بينما الملابس
            الحساسة تحتاج ماءً باردًا. اختر منظفاً معتدلاً وخالياً من المواد
            الكيميائية القاسية، وابتعد عن المبيضات إلا عند الضرورة. أخيراً، لا
            تفرط في عصر الملابس لتجنب تشوهها، ويفضل تجفيفها في الظل للحفاظ على
            ألوانها الزاهية.
          </h1>

          <div className="pb-4">
            <div>
              <h5 className="text-lg font-medium mt-12 mb-3">
                أفضل طرق تخزين الملابس الموسمية للحفاظ على جودتها
              </h5>
              <Image
                src={image6}
                alt="body-shap"
                width={500}
                height={500}
                className="w-[100%] md:w-[90%] mx-auto mb-5"
              />
              <p className="text-sm text-slate-500 flex flex-col gap-1 mb-2">
                <span className="leading-[21px] max-w-[600px]">
                  تخزين الملابس الموسمية بشكل صحيح يحميها من التلف والعوامل
                  البيئية. قبل التخزين، تأكد من غسل وتجفيف الملابس جيداً لتجنب
                  الروائح الكريهة والعفن. استخدم أكياس تخزين مضغوطة لتوفير
                  المساحة وحماية الملابس من الأتربة. ضع قطعًا من الفحم أو أكياس
                  اللافندر داخل صناديق التخزين لامتصاص الرطوبة وإبقاء الملابس
                  برائحة منعشة. الملابس الحساسة مثل الصوف والحرير تحتاج إلى
                  تغليفها بمواد ناعمة مثل ورق التواليت غير المعطر. يُفضل تخزين
                  الملابس في مكان بارد وجاف بعيد عن أشعة الشمس المباشرة.
                </span>
                <Image
                  src={image4}
                  alt="body-shap"
                  width={500}
                  height={500}
                  className="w-[100%] md:w-[70%] mb-2 mt-1"
                />
              </p>
              <p className="text-sm text-slate-500 flex flex-col gap-1 mb-2">
                <span className="text-lg font-medium mt-1 mb-3">
                  أخطاء شائعة عند العناية بالملابس وكيفية تجنبها:
                </span>
                <span className="leading-[21px] max-w-[600px]">
                  هناك العديد من الأخطاء التي قد تفسد الملابس دون قصد. على سبيل
                  المثال، غسل جميع الملابس معًا دون فرزها يؤدي إلى تصبغ الألوان.
                  استخدام الكثير من المنظفات يمكن أن يترك بقايا على الملابس
                  ويؤثر على نعومة الأقمشة. الكي بدرجات حرارة مرتفعة قد يتسبب في
                  تلف الملابس الرقيقة. لتجنب هذه الأخطاء، احرص على قراءة تعليمات
                  العناية الموجودة على الملصقات، استخدم منظفات مخصصة للأقمشة
                  الحساسة، وجرب استخدام البخار بدلاً من الكي التقليدي للملابس
                  الرقيقة.
                </span>
                <Image
                  src={image5}
                  alt="body-shap"
                  width={500}
                  height={500}
                  className="w-[100%] md:w-[70%] mb-2 mt-1"
                />
              </p>
              <p className="text-sm text-slate-500 flex flex-col gap-1 mb-2">
                <span className="text-lg font-medium mt-1 mb-3">
                  تخزين الملابس الموسمية بشكل صحيح يحميها من التلف والعوامل
                  البيئية:
                </span>
                <span className="leading-[21px] max-w-[600px]">
                  قبل التخزين، تأكد من غسل وتجفيف الملابس جيداً لتجنب الروائح
                  الكريهة والعفن. استخدم أكياس تخزين مضغوطة لتوفير المساحة
                  وحماية الملابس من الأتربة. ضع قطعًا من الفحم أو أكياس اللافندر
                  داخل صناديق التخزين لامتصاص الرطوبة وإبقاء الملابس برائحة
                  منعشة. الملابس الحساسة مثل الصوف والحرير تحتاج إلى تغليفها
                  بمواد ناعمة مثل ورق التواليت غير المعطر. يُفضل تخزين الملابس
                  في مكان بارد وجاف بعيد عن أشعة الشمس المباشرة.
                </span>
                <Image
                  src={image7}
                  alt="body-shap"
                  width={500}
                  height={500}
                  className="w-[100%] md:w-[70%] mb-2 mt-1"
                />
              </p>
              <p className="text-sm text-slate-500 flex flex-col gap-1 mb-2">
                <span className="leading-[21px] max-w-[600px]">
                  الأقمشة الحساسة مثل الحرير والصوف تحتاج إلى عناية خاصة للحفاظ
                  على جودتها. بالنسبة للحرير، يُفضل غسله يدويًا بالماء البارد
                  باستخدام منظف لطيف، ويجب تجفيفه بوضعه على منشفة ناعمة بعيداً
                  عن الشمس. أما الصوف، فيُغسل بماء فاتر باستخدام منظفات مخصصة
                  للصوف لتجنب انكماشه. عند تخزين هذه الأقمشة، استخدم أكياس
                  قماشية تسمح للهواء بالمرور. تجنب تعليق الملابس المصنوعة من
                  الصوف لفترات طويلة لأنها قد تفقد شكلها، وبدلاً من ذلك قم بطيها
                  بعناية.
                </span>
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default CareArticle;
